KanatERPSukhova.КанатАдаптация/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3404cb9a-92ea-42b9-9086-ad481dbc27d7">
  <name>ДоговорыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КАНАТ_ХранилищеИтоговыйТекст</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ПоСоглашению</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="d4de0c91-22dd-4ce4-bc98-884061653165">
    <name>ГосударственныйКонтракт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9b99d944-1b87-423e-a8a0-f6748f86530b">
    <name>НаименованиеДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f56e0158-d692-474d-bb59-3cb9fe0131ae">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec175e6e-8a0f-46c1-8f61-1933ed068350">
    <name>ДоговорСУчастникомГОЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c2821c1b-dcf2-47d6-9871-b26fe7c33e1f">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a00d91d9-5c1d-491a-b338-92dc631c1afd">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ba089968-9caa-4200-9002-b8f3267b4b61">
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6fe24eab-4e23-451e-8cae-c25d6e78e3df">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>КАНАТ_БлокиДоговора</name>
    <attributes>
      <name>БлокДоговора</name>
      <type>
        <types>CatalogRef.КАНАТ_БлокиДоговоров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Catalogs/ДоговорыКонтрагентов/ManagerModule.bsl
//++ Гурьев 18.09.23
Функция КАНАТ_ПолучитьНомерПоШаблону(Ссылка, Контрагент) Экспорт
	
	ДанныеКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "ИНН, Партнер");
	Код = ?(Не ДанныеКонтрагента.Партнер.Пустая(),
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеКонтрагента.Партнер, "Код"),
			" ");
			
	Код = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Код, Истина, Истина);
	Шаблон = СтрШаблон("%1-%2-%3-%4", 
					   Лев(ДанныеКонтрагента.ИНН, 2),
					   Код,
					   Формат(ТекущаяДата(), "ДФ=yyyy"),
					   "%");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ДоговорыКонтрагентов.Номер) КАК КоличествоНомер
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ГОД(ДоговорыКонтрагентов.Дата) = ГОД(&Дата)
		|	И ДоговорыКонтрагентов.Контрагент = &Контрагент
		|	И ДоговорыКонтрагентов.Ссылка <> &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	ДоговорыКонтрагентов.Номер КАК Номер
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Номер ПОДОБНО &Шаблон
		|	И ДоговорыКонтрагентов.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Дата",       ТекущаяДата());
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Шаблон",     Шаблон);
	Запрос.УстановитьПараметр("Ссылка",     Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	КоличествоДоговоров = РезультатЗапроса[0].Выгрузить()[0].КоличествоНомер;
	Если РезультатЗапроса[1].Пустой() Тогда
		
		Номер = СтрШаблон("%1-%2-%3-%4", 
					   Лев(ДанныеКонтрагента.ИНН, 2),
					   Код,
					   Формат(ТекущаяДата(), "ДФ=yyyy"),
					   КоличествоДоговоров + 1);
		
		Возврат СтрЗаменить(Номер, " ", "");
		
	Иначе
		
		Выборка = РезультатЗапроса[1].Выбрать();
		
		
		МаксПорядковыйНомер = -1;
		Пока Выборка.Следующий() Цикл
			
			СтрокаНомера = Выборка.Номер;
			ПорядковыйНомерСтр = Прав(СтрокаНомера,
									  СтрДлина(СтрокаНомера) - (СтрДлина(Шаблон)-1));
			
			Попытка
				
				ПорядковыйНомер = Число(ПорядковыйНомерСтр);
				Если ПорядковыйНомер > МаксПорядковыйНомер Тогда
					МаксПорядковыйНомер = ПорядковыйНомер;
				КонецЕсли;
				
			Исключение
				
				Продолжить;
				
			КонецПопытки;
		КонецЦикла;
		
		ИтоговыйПорядковыйНомер = ?(КоличествоДоговоров > МаксПорядковыйНомер,
									КоличествоДоговоров + 1,
									МаксПорядковыйНомер + 1);
		
		Номер = СтрШаблон("%1-%2-%3-%4", 
					   Лев(ДанныеКонтрагента.ИНН, 2),
					   Код,
					   Формат(ТекущаяДата(), "ДФ=yyyy"),
					   ИтоговыйПорядковыйНомер);
					   
		Возврат СтрЗаменить(Номер, " ", "");
		
	КонецЕсли;
	
КонецФункции
//-- Гурьев 18.09.23
